tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "mac-cleanup/mac-cleanup-py"
brew "autoconf"
brew "bash"
brew "bat"
brew "bottom"
brew "cdrtools"
brew "coreutils"
brew "deno"
brew "dprint"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gitui"
brew "gnu-sed"
brew "grep"
brew "helix"
brew "jq"
brew "lsd"
brew "neofetch"
brew "neovim"
brew "ouch"
brew "pueue"
brew "python@3.10"
brew "rustup-init"
brew "sbcl"
brew "sd"
brew "shellcheck"
brew "spice-gtk"
brew "starship"
brew "tealdeer"
brew "trash"
brew "wget"
brew "xdg-ninja"
brew "zellij"
brew "zoxide"
brew "zplug"
brew "zsync"
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
cask "activitywatch"
cask "alacritty"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appflowy"
cask "battery-buddy"
cask "bitwarden"
cask "blender"
cask "chromium"
cask "cryptomator"
cask "docker"
cask "emacs"
cask "espanso"
cask "eudic"
cask "fedora-media-writer"
cask "firefox"
cask "flameshot"
cask "flux"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-devicons"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "hiddenbar"
cask "hyper"
cask "iina"
cask "impactor"
cask "itsycal"
cask "keka"
cask "key-codes"
cask "keyboardholder"
cask "localsend"
cask "microsoft-edge"
cask "monitorcontrol"
cask "motrix"
cask "neteasemusic"
cask "postman"
cask "qq"
cask "raspberry-pi-imager"
cask "raycast"
cask "rustdesk"
cask "squirrel"
cask "thunderbird"
cask "tunnelblick"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vscodium"
cask "warp"
cask "wechat"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "AMiner.codegeex"
vscode "antfu.icons-carbon"
vscode "antfu.slidev"
vscode "antfu.theme-vitesse"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "chenglou92.rescript-vscode"
vscode "Codeium.codeium"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dotenv.dotenv-vscode"
vscode "dprint.dprint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "ExodiusStudios.comment-anchors"
vscode "file-icons.file-icons"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "foxundermoon.shell-format"
vscode "gebeto.vscode-scriptable"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hediet.debug-visualizer"
vscode "IBM.output-colorizer"
vscode "jock.svg"
vscode "kdl-org.kdl"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "webhint.vscode-webhint"
vscode "wix.vscode-import-cost"
vscode "xitu.juejin"
vscode "yinfei.luahelper"
vscode "ZixuanChen.vitest-explorer"
